#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.webprofile_apim_api_weu.azurerm_api_management_api_operation_policy.unlock_user_session_policy_itn: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff/operations/unlockUserSession]
module.webprofile_apim_api_itn.azurerm_api_management_api_operation_policy.unlock_user_session_policy_itn: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff/operations/unlockUserSession]
module.webprofile_apim_api_itn.azurerm_api_management_named_value.io_fn3_services_key_itn: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/ioweb-profile-api-key]
module.webprofile_apim_api_weu.azurerm_api_management_named_value.io_fn3_services_key_itn: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/namedValues/ioweb-profile-api-key]
module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_api.this: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff]
module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_api.this: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff]
module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_product_api.this["io-web-api"]: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/io-web-api/apis/io-p-ioweb-bff]
module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_api_policy.this[0]: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff]
module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_product_api.this["io-web-api"]: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/products/io-web-api/apis/io-p-ioweb-bff]
module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_api_policy.this[0]: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.function_lollipop.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (24 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02"
        name                                           = "io-p-itn-auth-lollipop-func-02"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (27 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_lollipop.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (25 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_lollipop.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled             = false -> true
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Insights/metricAlerts/io-p-itn-auth-lollipop-func-02] Health Check Failed"
        name                = "io-p-itn-auth-lollipop-func-02] Health Check Failed"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_linux_function_app" "this" {
      + app_settings                                   = (known after apply)
      + auth_settings                                  = (known after apply)
      + auth_settings_v2                               = (known after apply)
      + availability                                   = (known after apply)
      + backup                                         = (known after apply)
      + builtin_logging_enabled                        = (known after apply)
      + client_certificate_enabled                     = (known after apply)
      + client_certificate_exclusion_paths             = (known after apply)
      + client_certificate_mode                        = (known after apply)
      + connection_string                              = (known after apply)
      + content_share_force_disabled                   = (known after apply)
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = (known after apply)
      + default_hostname                               = (known after apply)
      + enabled                                        = (known after apply)
      + ftp_publish_basic_authentication_enabled       = (known after apply)
      + functions_extension_version                    = (known after apply)
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = (known after apply)
      + id                                             = (known after apply)
      + identity                                       = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = (known after apply)
      + name                                           = "io-p-itn-auth-lollipop-func-02"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = (known after apply)
      + resource_group_name                            = "io-p-itn-auth-lollipop-rg-02"
      + service_plan_id                                = (known after apply)
      + site_config                                    = (known after apply)
      + site_credential                                = (sensitive value)
      + sticky_settings                                = (known after apply)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = (known after apply)
      + storage_key_vault_secret_id                    = (known after apply)
      + storage_uses_managed_identity                  = (known after apply)
      + tags                                           = (known after apply)
      + usage                                          = (known after apply)
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = (known after apply)
    }

  # module.function_lollipop_autoscale.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-auth-lollipop-as-02" -> (known after apply)
      ~ location            = "italynorth" # forces replacement -> (known after apply) # forces replacement
        name                = "io-p-itn-auth-lollipop-as-02"
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)

      ~ profile {
            name = "evening"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = jsonencode(
                {
                    for  = "evening"
                    name = "default"
                }
            )

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
      ~ profile {
            name = "wallet_ga"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/sites/io-p-itn-auth-lollipop-func-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lollipop-rg-02/providers/Microsoft.Web/serverfarms/io-p-itn-auth-lollipop-asp-02" -> (known after apply)
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.function_web_profile.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                = (sensitive value)
          ~ "EXCHANGE_JWT_PRIMARY_PUB_KEY"                    = (sensitive value)
          ~ "HUB_SPID_LOGIN_JWT_PUB_KEY"                      = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"              = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                  = (sensitive value)
            # (30 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01"
        name                                           = "io-p-itn-auth-webprof-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_web_profile.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "EXCHANGE_JWT_PRIMARY_PRIVATE_KEY"                = (sensitive value)
          ~ "EXCHANGE_JWT_PRIMARY_PUB_KEY"                    = (sensitive value)
          ~ "HUB_SPID_LOGIN_JWT_PUB_KEY"                      = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PRIVATE_KEY"              = (sensitive value)
          ~ "MAGIC_LINK_JWE_PRIMARY_PUB_KEY"                  = (sensitive value)
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-webprof-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-webprof-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.webprofile_apim_api_itn.azurerm_api_management_api_operation_policy.unlock_user_session_policy_itn will be imported
    resource "azurerm_api_management_api_operation_policy" "unlock_user_session_policy_itn" {
        api_management_name = "io-p-itn-apim-01"
        api_name            = "io-p-ioweb-bff"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff/operations/unlockUserSession"
        operation_id        = "unlockUserSession"
        resource_group_name = "io-p-itn-common-rg-01"
        xml_content         = <<-EOT
            <policies>
            	<inbound>
            		<base />
            		<!-- ApiRateLimit 10 requests/5seconds based on Client IP Address -->
            		<rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
            		<!-- ApiRateLimit 10 requests/5seconds based on Access Token -->
            		<rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("Authorization").AsJwt()?.Claims.GetValueOrDefault("fiscal_number", ""))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
            	</inbound>
            	<backend>
            		<base />
            	</backend>
            	<outbound>
            		<base />
            	</outbound>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_itn.azurerm_api_management_named_value.io_fn3_services_key_itn will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/ioweb-profile-api-key")
  ~ resource "azurerm_api_management_named_value" "io_fn3_services_key_itn" {
        api_management_name = "io-p-itn-apim-01"
        display_name        = "ioweb-profile-api-key"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/namedValues/ioweb-profile-api-key"
        name                = "ioweb-profile-api-key"
        resource_group_name = "io-p-itn-common-rg-01"
        secret              = true
        tags                = []
      + value               = (sensitive value)
    }

  # module.webprofile_apim_api_weu.azurerm_api_management_api_operation_policy.unlock_user_session_policy_itn will be imported
    resource "azurerm_api_management_api_operation_policy" "unlock_user_session_policy_itn" {
        api_management_name = "io-p-apim-v2-api"
        api_name            = "io-p-ioweb-bff"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff/operations/unlockUserSession"
        operation_id        = "unlockUserSession"
        resource_group_name = "io-p-rg-internal"
        xml_content         = <<-EOT
            <policies>
            	<inbound>
            		<base />
            		<!-- ApiRateLimit 10 requests/5seconds based on Client IP Address -->
            		<rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("X-Forwarded-For"))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
            		<!-- ApiRateLimit 10 requests/5seconds based on Access Token -->
            		<rate-limit-by-key calls="5" renewal-period="10" counter-key="@(context.Request.Headers.GetValueOrDefault("Authorization").AsJwt()?.Claims.GetValueOrDefault("fiscal_number", ""))" retry-after-header-name="x-rate-limit-retry-after" remaining-calls-header-name="x-rate-limit-remaining" />
            	</inbound>
            	<backend>
            		<base />
            	</backend>
            	<outbound>
            		<base />
            	</outbound>
            	<on-error>
            		<base />
            	</on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_weu.azurerm_api_management_named_value.io_fn3_services_key_itn will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/namedValues/ioweb-profile-api-key")
  ~ resource "azurerm_api_management_named_value" "io_fn3_services_key_itn" {
        api_management_name = "io-p-apim-v2-api"
        display_name        = "ioweb-profile-api-key"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/namedValues/ioweb-profile-api-key"
        name                = "ioweb-profile-api-key"
        resource_group_name = "io-p-rg-internal"
        secret              = true
        tags                = []
      + value               = (sensitive value)
    }

  # module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_api.this will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff")
  ~ resource "azurerm_api_management_api" "this" {
        api_management_name   = "io-p-itn-apim-01"
        api_type              = "http"
        description           = "Bff API for IO Web platform"
        display_name          = "IO Web - Bff"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff"
        is_current            = true
        is_online             = false
        name                  = "io-p-ioweb-bff"
        path                  = "ioweb/backend/api/v1"
        protocols             = [
            "https",
        ]
        resource_group_name   = "io-p-itn-common-rg-01"
        revision              = "1"
        service_url           = "https://io-p-itn-auth-webprof-func-01.azurewebsites.net/api/v1"
        soap_pass_through     = false
        subscription_required = false

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-web-profile-backend/a2a6be1434e75089fb46e1aba50678cbbe32afd1/openapi/external.yaml"
        }

        subscription_key_parameter_names {
            header = "Ocp-Apim-Subscription-Key"
            query  = "subscription-key"
        }
    }

  # module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_api_policy.this[0] will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff")
  ~ resource "azurerm_api_management_api_policy" "this" {
        api_management_name = "io-p-itn-apim-01"
        api_name            = "io-p-ioweb-bff"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/apis/io-p-ioweb-bff"
        resource_group_name = "io-p-itn-common-rg-01"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{ioweb-profile-api-key}}</value>
          - 		</set-header>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>https://ioapp.it/</origin>
          - 			</allowed-origins>
          - 			<allowed-methods preflight-result-max-age="300">
          - 				<method>OPTIONS</method>
          - 				<method>GET</method>
          - 				<method>POST</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>Content-Type</header>
          - 				<header>Authorization</header>
          - 			</allowed-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-header name="x-functions-key" exists-action="override">
          +       <value>{{ioweb-profile-api-key}}</value>
          +     </set-header>
          +     <cors>
          +       <allowed-origins>
          +         <origin>https://ioapp.it/</origin>
          +         <origin>https://account.ioapp.it/</origin>
          +       </allowed-origins>
          +       <allowed-methods preflight-result-max-age="300">
          +         <method>OPTIONS</method>
          +         <method>GET</method>
          +         <method>POST</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +         <header>Content-Type</header>
          +         <header>Authorization</header>
          +       </allowed-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_itn.module.apim_itn_bff_api.azurerm_api_management_product_api.this["io-web-api"] will be imported
    resource "azurerm_api_management_product_api" "this" {
        api_management_name = "io-p-itn-apim-01"
        api_name            = "io-p-ioweb-bff"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-apim-01/products/io-web-api/apis/io-p-ioweb-bff"
        product_id          = "io-web-api"
        resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_api.this will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff")
  ~ resource "azurerm_api_management_api" "this" {
        api_management_name   = "io-p-apim-v2-api"
        api_type              = "http"
        description           = "Bff API for IO Web platform"
        display_name          = "IO Web - Bff"
        id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff"
        is_current            = true
        is_online             = false
        name                  = "io-p-ioweb-bff"
        path                  = "ioweb/backend/api/v1"
        protocols             = [
            "https",
        ]
        resource_group_name   = "io-p-rg-internal"
        revision              = "1"
        service_url           = "https://io-p-itn-auth-webprof-func-01.azurewebsites.net/api/v1"
        soap_pass_through     = false
        subscription_required = false

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-web-profile-backend/a2a6be1434e75089fb46e1aba50678cbbe32afd1/openapi/external.yaml"
        }

        subscription_key_parameter_names {
            header = "Ocp-Apim-Subscription-Key"
            query  = "subscription-key"
        }
    }

  # module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_api_policy.this[0] will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff")
  ~ resource "azurerm_api_management_api_policy" "this" {
        api_management_name = "io-p-apim-v2-api"
        api_name            = "io-p-ioweb-bff"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-bff"
        resource_group_name = "io-p-rg-internal"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{ioweb-profile-api-key}}</value>
          - 		</set-header>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>https://ioapp.it/</origin>
          - 			</allowed-origins>
          - 			<allowed-methods preflight-result-max-age="300">
          - 				<method>OPTIONS</method>
          - 				<method>GET</method>
          - 				<method>POST</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>Content-Type</header>
          - 				<header>Authorization</header>
          - 			</allowed-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-header name="x-functions-key" exists-action="override">
          +       <value>{{ioweb-profile-api-key}}</value>
          +     </set-header>
          +     <cors>
          +       <allowed-origins>
          +         <origin>https://ioapp.it/</origin>
          +         <origin>https://account.ioapp.it/</origin>
          +       </allowed-origins>
          +       <allowed-methods preflight-result-max-age="300">
          +         <method>OPTIONS</method>
          +         <method>GET</method>
          +         <method>POST</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +         <header>Content-Type</header>
          +         <header>Authorization</header>
          +       </allowed-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
    }

  # module.webprofile_apim_api_weu.module.apim_itn_bff_api.azurerm_api_management_product_api.this["io-web-api"] will be imported
    resource "azurerm_api_management_product_api" "this" {
        api_management_name = "io-p-apim-v2-api"
        api_name            = "io-p-ioweb-bff"
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/products/io-web-api/apis/io-p-ioweb-bff"
        product_id          = "io-web-api"
        resource_group_name = "io-p-rg-internal"
    }

Plan: 10 to import, 1 to add, 11 to change, 1 to destroy.

Warning: Deprecated Resource

  with data.azurerm_app_service_plan.shared_plan_itn,
  on data.tf line 35, in data "azurerm_app_service_plan" "shared_plan_itn":
  35: data "azurerm_app_service_plan" "shared_plan_itn" {

The `azurerm_app_service_plan` data source has been superseded by the
`azurerm_service_plan` data source. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
